# PlanCircuit Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
PlanCircuit Class
Members See Also
---
An object that represents an enclosed area in a plan view within the Autodesk Revit project.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class PlanCircuit : APIObject
```

Visual Basic
---
```text
Public Class PlanCircuit _
	Inherits APIObject
```

Visual C++
---
```text
public ref class PlanCircuit : public APIObject
```

# Remarks
Plan circuits are enclosed regions as seen on a plan view. They are used to determine the boundary extents of rooms based on the placement of walls. In the Autodesk Revit API, you can use plan circuits to create new rooms.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..PlanCircuit
# See Also
PlanCircuit Members
Autodesk.Revit.DB Namespace